{
  "eng": {
    "welcome_msg": "Welcome to LinAlert!",
    "select_lang": "Language:",
    "location": "Please enter the name of your city or town, or enter your ZIP Code and LinAlert will keep it in mind to get your local weather and alerts:",
    "current_forecast": "The current forecast in {LOCATION} is:",
    "alert_msg": "The National Weather Service has issued an {ALERTTYPE} for {AREAS} until {TIME}.",
    "watch_msg": "A {ALERTTYPE} is in effect for {AREAS} until {TIME}. Be prepared.",
    "adv_msg": "A {ALERTTYPE} has been issued for {AREAS}. Exercise caution.",
    "stat_msg": "A significant weather statement has been issued for {AREAS}.",
    "torsafe": "Immediately get to an underground shelter now. Your life may be in danger. Do not go outside. Stay indoors.",
    "tstormsafe": "Please do not go outside unless necessary, for purposes like groceries, food, or work.",
    "wstormsafe": "Expect large amounts of snow. If you are planning to drive, ensure you have winter tires or chains applied to your vehicle. Staying indoors is recommended. Turn on the heat. Drip pipes to prevent other water sources from freezing.",
    "hurr_safe": "Secure your property. Follow all evacuation orders from local officials. Stay away from windows.",
    "flood_safe": "Turn around, don't drown. Do not attempt to drive through flooded roadways.",
    "marine_safe": "Small craft should remain in port. Seek safe harbor immediately.",
    "extreme_danger": "EXTREME THREAT TO LIFE AND PROPERTY! EVACUATE! EVACUATE! EVACUATE! IT IS NOT SAFE IN UNDERGROUND AREAS.",
    "severe_danger": "SIGNIFICANT THREAT TO LIFE AND PROPERTY! EVACUATE! EVACUATE! EVACUATE!",
    "moderate_danger": "POSSIBLE THREAT TO LIFE AND PROPERTY! EVACUATE TO NEAREST SHELTER NOW.",
    "status_observed": "reported by trained spotters",
    "status_radar": "indicated by doppler radar",
    "test_msg": "This is a coordinated test of the Emergency Alert System. This is only a test. LinAlert follows these tests to comply with certain standards.",
    "test_footer": "If this had been an actual emergency, official instructions would have followed the alert tones. This message was only a test; no emergency is active.",
    "menu_title": "--- LinAlert Settings ---",
    "set_lang": "1. Change Language (Current: English)",
    "set_voice": "2. Select Voice Engine (Paul/Standard)",
    "set_location": "3. Update Location/ZIP Code",
    "set_audio_out": "4. Audio Output Device",
    "set_screech": "5. Toggle SAME Header Tones (ON/OFF)",
    "set_priority": "6. High-Priority Alert Mode (ON/OFF)",
    "save_exit": "7. Save and Exit"
  },
  "span": {
    "welcome_msg": "¡Bienvenido a LinAlert!",
    "select_lang": "Idioma:",
    "location": "Por favor, ingrese el nombre de su ciudad o pueblo, o ingrese su código postal y LinAlert lo tendrá en cuenta para obtener el clima y las alertas locales:",
    "current_forecast": "El pronóstico actual en {LOCATION} es:",
    "alert_msg": "El Servicio Nacional de Meteorología ha emitido una {ALERTTYPE} para {AREAS} hasta las {TIME}.",
    "watch_msg": "Una {ALERTTYPE} está en efecto para {AREAS} hasta las {TIME}. Esté preparado.",
    "adv_msg": "Se ha emitido una {ALERTTYPE} para {AREAS}. Tenga precaución.",
    "stat_msg": "Se ha emitido una declaración meteorológica significativa para {AREAS}.",
    "torsafe": "Busque refugio bajo tierra inmediatamente. Su vida puede estar en peligro. No salga al exterior. Permanezca adentro.",
    "tstormsafe": "Por favor, no salga al exterior a menos que sea necesario, para propósitos como víveres, comida o trabajo.",
    "wstormsafe": "Se esperan grandes cantidades de nieve. Si planea conducir, asegúrese de tener neumáticos de invierno o cadenas en su vehículo. Se recomienda permanecer bajo techo. Encienda la calefacción. Deje gotear las tuberías para evitar que se congelen.",
    "hurr_safe": "Asegure su propiedad. Siga todas las órdenes de evacuación de los oficiales locales. Manténgase alejado de las ventanas.",
    "flood_safe": "Dese la vuelta, ¡no se ahogue! No intente conducir por carreteras inundadas.",
    "marine_safe": "Las embarcaciones pequeñas deben permanecer en puerto. Busque refugio seguro de inmediato.",
    "extreme_danger": "¡AMENAZA EXTREMA A LA VIDA Y PROPIEDAD! ¡EVACUE! ¡EVACUE! ¡EVACUE! NO ES SEGURO EN ÁREAS SUBTERRÁNEAS.",
    "severe_danger": "¡AMENAZA SIGNIFICATIVA A LA VIDA Y PROPIEDAD! ¡EVACUE! ¡EVACUE! ¡EVACUE!",
    "moderate_danger": "¡AMENAZA POSIBLE A LA VIDA Y PROPIEDAD! EVACUE AL REFUGIO MÁS CERCANO AHORA.",
    "status_observed": "reportado por observadores capacitados",
    "status_radar": "indicado por el radar doppler",
    "test_msg": "Esta es una prueba coordinada del Sistema de Alerta de Emergencia. Esto es solo una prueba. LinAlert sigue estas pruebas para cumplir con ciertos estándares.",
    "test_footer": "Si esto hubiera sido una emergencia real, las instrucciones oficiales habrían seguido a los tonos de alerta. Este mensaje fue solo una prueba; no hay ninguna emergencia activa.",
    "menu_title": "--- Configuración de LinAlert ---",
    "set_lang": "1. Cambiar Idioma (Actual: Español)",
    "set_voice": "2. Seleccionar Motor de Voz (Violetta/Estándar)",
    "set_location": "3. Actualizar Ubicación/Código Postal",
    "set_audio_out": "4. Dispositivo de Salida de Audio",
    "set_screech": "5. Alternar Tonos de Cabecera SAME (ENCENDIDO/APAGADO)",
    "set_priority": "6. Modo de Alerta de Alta Prioridad (ENCENDIDO/APAGADO)",
    "save_exit": "7. Guardar y Salir"
  }
